Extras/OPS5/README.org
#                            -*- mode: org; -*-
#
#+TITLE:            OPS5 Rule-Based System for Youtoo 0.93
#+AUTHOR:              Tracy Gardner and Andreas Kind
#+DATE:               July 1997\\Updated February 2010
#+LINK:           http://www.cs.bath.ac.uk/~jap/ak1/youtoo
#+OPTIONS: ^:{} email:nil

* Copyright
  Youtoo is free software; you can redistribute it and/or modify it under the
  terms of the GNU General Public License as published by the Free Software
  Foundation; either version 2 of the License, or (at your option) any later
  version.  See the file COPYING in this directory, for a description of the GNU
  General Public License terms under which you can copy the files.

* [[file:../../README.org][Youtoo README]]

* General Description
  This is an object-oriented version of the OPS5 rule-based system.

* Installation and test
  + make
  + make test
  + ./test1 Mab.l
  + (see Makefile for more information)
