Extras/OPS5/README.html
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>OPS5 Rule-Based System for Youtoo 0.93</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="July 1997\\Updated February 2010"/>
<meta name="author" content="Tracy Gardner and Andreas Kind"/>
</head><body>
<h1 class="title">OPS5 Rule-Based System for Youtoo 0.93</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Copyright </a></li>
<li><a href="#sec-2">2 EuLisp index </a></li>
<li><a href="#sec-3">3 General Description </a></li>
<li><a href="#sec-4">4 Installation and test </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">1 Copyright </h2>
<div id="text-1">

<p>Youtoo is free software; you can redistribute it and/or modify it under the
terms of the GNU General Public License as published by the Free Software
Foundation; either version 2 of the License, or (at your option) any later
version.  See the file COPYING in this directory, for a description of the GNU
General Public License terms under which you can copy the files.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">2 <a href="../../index.html">EuLisp index</a> </h2>
<div id="text-2">


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">3 General Description </h2>
<div id="text-3">

<p>This is an object-oriented version of the OPS5 rule-based system.
</p>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">4 Installation and test </h2>
<div id="text-4">

<ul>
<li>
make
</li>
<li>
make test
</li>
<li>
./test1 Mab.l
</li>
<li>
(see Makefile for more information)
</li>
</ul>
</div>
</div>
<div id="postamble"><p class="author"> Author: Tracy Gardner and Andreas Kind
<a href="mailto:henry@dm.opencfd.co.uk">&lt;henry@dm.opencfd.co.uk&gt;</a>
</p>
<p class="date"> Date: July 1997\\Updated February 2010</p>
<p>HTML generated by org-mode 6.21b in emacs 23</p>
</div></body>
</html>
